{
    "recettes": [
      {
        "nom": "Thieboudiene",
        "ingredients": [
          "Poisson (de préférence poisson maquereau, lotte ou dorade)",
          " 2 tasses de riz",
          " 2 oignons",
          " 3 tomates",
          " 3 gousses d'ail",
          " 1 petit chou ou des feuilles de chou",
          " 3 carottes",
          " 3 aubergines africaines (optionnelles)",
          " 1 petit morceau de gingembre",
          " 1 piment (selon le goût)",
          " 1 cube de bouillon de poisson ou de légumes",
          " Sel",
          " Poivre",
          " Huile végétale."
        ],
        "instructions": [
          "Nettoyer et couper le poisson en morceaux. Assaisonner avec du sel et du poivre",
          " Dans une grande casserole ou un faitout, faire chauffer de l'huile et faire revenir les morceaux de poisson jusqu'à ce qu'ils soient dorés. Retirer et réserver",
          " Dans la même casserole ou un faitout, faire chauffer de l'huile et faire revenir les morceaux de poisson jusqu'à ce qu'ils soient dorés. Retirer et réserver",
          " Ajouter les tomates pelées et coupées en dés. Laisser mijoter jusqu'à ce que les tomates soient bien cuites et que la sauce soit formée",
          " Ajouter les légumes coupés en morceaux (chou, carottes, aubergines) dans la casserole avec un peu d'eau si nécessaire. Laisser cuire jusqu'à ce que les légumes soient tendres",
          " Ajouter le riz dans la casserole, mélanger avec les légumes et ajouter suffisamment d'eau pour cuire le riz",
          " Dissoudre le cube de bouillon dans l'eau et verser sur le mélange. Assaisonner avec du sel et du poivre selon votre goût",
          " Placer les morceaux de poisson dorés sur le dessus du mélange de riz et de légumes. Couvrir la casserole et laisser mijoter à feu doux jusqu'à ce que le riz soit cuit et absorbe toute l'eau."
        ]
      },
      {
        "nom": "Yassa poulet",
        "ingredients": [
          "1 poulet coupé en morceaux",
          " 4 oignons",
          " 3 citrons (jus)",
          " 4 gousses d'ail",
          " 3 cuillères à soupe d'huile végétale",
          " 2 cuillères à soupe de moutarde",
          " 2 cuillères à soupe de vinaigre",
          " 2 bouillons cube",
          " Poivre noir",
          " 2 piments (selon le goût)",
          " 2 feuilles de laurier (selon le goût)",
          " Sel",
          " 2 tasses de riz",
          " Eau."
        ],
        "instructions": [
          "Dans un bol, mélanger le jus des citrons, la moutarde, le vinaigre, du sel et du poivre. C'est la marinade pour le poulet",
          " Mariner les morceaux de poulet avec ce mélange et laisser reposer pendant au moins 1 heure au réfrigérateur",
          " Émincer finement les oignons et les faire revenir dans une grande poêle avec de l'huile jusqu'à ce qu'ils deviennent dorés et caramélisés",
          " Ajouter l'ail écrasé, les bouillons cube de volaille émiettés, les piments coupés en petits morceaux et éventuellement les feuilles de laurier dans la poêle. Laisser cuire quelques minutes",
          " Retirer les morceaux de poulet de la marinade et les faire dorer dans la poêle avec les oignons et les épices jusqu'à ce qu'ils soient bien dorés",
          " Verser la marinade sur le poulet et les oignons. Ajouter un peu d'eau si nécessaire pour créer une sauce et laisser mijoter à feu doux jusqu'à ce que le poulet soit cuit et que la sauce ait réduit",
          " Rincer abondamment le riz à l'eau froide jusqu'à ce que l'eau soit claire pour éliminer l'excès d'amidon",
          " Dans une casserole, verser le riz et ajouter de l'eau en utilisant un ratio de 1:2 (pour chaque tasse de riz, utiliser deux tasses d'eau). Ajouter une pincée de sel",
          " Porter à ébullition à feu moyen-élevé",
          " Réduire le feu à son minimum, couvrir la casserole avec un couvercle hermétique et laisser mijoter pendant environ 15-20 minutes, ou jusqu'à ce que tout le liquide soit absorbé",
          " Une fois cuit, retirer du feu et laisser reposer le riz pendant quelques minutes à couvert avant de le servir."
        ]
      },
      {
        "nom": "Soupe kandia",
        "ingredients": [
          "500g de gombos frais ou surgelés",
          " 500g de fruits de mer",
          " 2 oignons",
          " 3 tomates",
          " 3 gousses d'ail",
          " 1 piment (selon le goût)",
          " 2 cuillères à soupe d'huile végétale",
          " 2 bouillons cube",
          " Poivre",
          " Feuilles de persil ou coriandre (optionnelles)",
          " Sel",
          " 2 tasses de riz",
          " Eau."
        ],
        "instructions": [
          "Si tu utilises des poissons séchés, commence par les faire tremper dans de l'eau tiède pendant un certain temps pour les réhydrater",
          " Dans une casserole, fais revenir les oignons hachés, l'ail écrasé et le piment dans de l'huile jusqu'à ce qu'ils deviennent translucides",
          " Ajoute les tomates coupées en dés et laisse mijoter jusqu'à ce qu'elles soient bien cuites et que la sauce se forme",
          " Ajoute les fruits de mer réhydratés (poissons séchés, crevettes, calamars, etc.) dans la casserole avec un peu d'eau si nécessaire",
          " Ajoute les cubes de bouillon émiettés et assaisonne avec du sel et du poivre selon ton goût",
          " Laisse mijoter à feu moyen jusqu'à ce que les fruits de mer soient bien cuits et que les saveurs se mélangent",
          " Rincer abondamment le riz à l'eau froide jusqu'à ce que l'eau soit claire pour éliminer l'excès d'amidon",
          " Dans une casserole, verser le riz et ajouter de l'eau en utilisant un ratio de 1:2 (pour chaque tasse de riz, utiliser deux tasses d'eau). Ajouter une pincée de sel",
          " Porter à ébullition à feu moyen-élevé",
          " Réduire le feu à son minimum, couvrir la casserole avec un couvercle hermétique et laisser mijoter pendant environ 15-20 minutes, ou jusqu'à ce que tout le liquide soit absorbé",
          " Une fois cuit, retirer du feu et laisser reposer le riz pendant quelques minutes à couvert",
          " Garnis éventuellement de feuilles de persil ou de coriandre avant de servir."
        ]
      },
      {
        "nom": "Jus Bissap",
        "ingredients": [
          "2 tasses de fleurs d'hibiscus séchés (bissap)",
          " 1.5 à 2 litres d'eau",
          " Sucre",
          " 1 ou 2 bâtons de cannelle (optionnel)",
          " 1 morceau de gingembre (optionnel)",
          " Jus de citron (optionnel)."
        ],
        "instructions": [
          "Rincer les fleurs d'hibiscus à l'eau pour enlever toute impureté",
          " Dans une casserole, porter à ébullition l'eau avec les fleurs d'hibiscus, le gingembre et les bâtons de cannelle (si utilisés)",
          " Laisser mijoter pendant environ 15 à 20 minutes. Tu verras que l'eau prendra une couleur rouge profonde",
          " Retirer du feu et laisser refroidir. Ensuite, filtrer le liquide pour enlever les fleurs d'hibiscus, le gingembre et la cannelle (si utilisés)",
          " Ajouter du sucre ou tout autre édulcorant selon ton goût. Tu peux aussi ajouter un peu de jus de citron pour un goût acidulé si tu le souhaites",
          " Réfrigérer le jus de bissap pendant quelques heures avant de le servir."
        ]
      },
      {
        "nom": "Thiakry",
        "ingredients": [
          "1 tasse de mil",
          " 1 litre de lait",
          " 1 litre de yaourt nature",
          " 1 litre de sucre (au goût)",
          " 1 cuillère à café d'extrait de vanille",
          " Arachides grillées (au goût)",
          " Noix de coco râpée (au goût)."
        ],
        "instructions": [
          "Faire bouillir le lait dans une casserole. Ajouter le mil en pluie tout en remuant constamment pour éviter les grumeaux",
          " Réduire le feu et laisser mijoter doucement tout en remuant régulièrement jusqu'à ce que le mil soit cuit et que le mélange épaississe. Cela peut prendre environ 20 à 30 minutes",
          " Retirer du feu et laisser refroidir le mélange de lait et de mil",
          " Une fois refroidi, ajouter le yaourt, le sucre et l'extrait de vanille (ou de fleur d'oranger) au mélange de lait et de mil",
          " Bien mélanger jusqu'à obtenir une consistance homogène",
          " Mettre le thiakry au réfrigérateur pendant au moins quelques heures pour le refroidir avant de le servir",
          " Au moment de servir, tu peux garnir le thiakry avec des arachides grillées concassées ou de la noix de coco râpée pour ajouter une texture et des saveurs supplémentaires."
        ]
      },
      {
        "nom": "Ngalakh",
        "ingredients": [
          "1 tasse de mil",
          " 1 litre d'eau",
          " 1 tasse de sucre",
          " 1 pincée de sel",
          " 1 tasse d'arachides non salées (optionnel)",
          " 1 cuillère à soupe d'huile végétale (optionnel)",
          " Fruits secs."
        ],
        "instructions": [
          "Faire tremper le mil dans de l'eau pendant quelques heures (ou toute une nuit) pour ramollir les grains",
          " Rincer et égoutter le mil",
          " Dans une casserole, faire bouillir l'eau et y ajouter le mil",
          " Ajouter une pincée de sel. Laisser cuire à feu moyen jusqu'à ce que le mil soit tendre et que l'eau soit absorbée. Cela peut prendre environ 45 minutes à 1 heure. Remuer régulièrement pour éviter que le mil ne colle au fond de la casserole",
          " Pendant ce temps, faire griller les arachides dans une poêle à sec jusqu'à ce qu'elles soient légèrement dorées. Laisser refroidir, puis les broyer ou les réduire en poudre à l'aide d'un mixeur ou d'un mortier",
          " Ajouter éventuellement une cuillère à soupe d'huile végétale pour lisser la texture et mélanger",
          " Laisser refroidir le ngalakh avant de le servir. Tu peux le présenter dans des bols individuels et le garnir de fruits secs comme des dattes ou des raisins."
        ]
      },
      {
        "nom": "Beignets Dougoup",
        "ingredients": [
          "2 tasses de mil",
          " 1 tasse de farine de blé",
          " 1 cuillère à café de levure chimique",
          " 1 cuillère à soupe de sucre",
          " Eau",
          " 1 pincée de sel",
          " Huile végétale."
        ],
        "instructions": [
          "Commence par moudre le mil pour obtenir une poudre fine",
          " Dans un grand bol, mélange la farine de mil, la farine de blé, le sucre, la levure chimique et une pincée de sel",
          " Ajoute de l'eau progressivement tout en mélangeant jusqu'à obtenir une pâte épaisse et lisse, semblable à celle d'une pâte à beignets",
          " Laisse reposer la pâte pendant environ 30 minutes pour qu'elle repose et se repose",
          " Chauffe de l'huile dans une casserole ou une friteuse à feu moyen",
          " À l'aide d'une cuillère, prends des portions de pâte et forme des petites boules que tu plongeras dans l'huile chaude pour les frire",
          " Fais frire les beignets jusqu'à ce qu'ils soient dorés et bien cuits à l'intérieur",
          " Retire-les de l'huile et place-les sur du papier absorbant pour éliminer l'excès d'huile."
        ]
      },
      {
        "nom": "Fatayas",
        "ingredients": [
          "500g de farine",
          " 1 cuillère à café de levure boulangère",
          " Huile végétale",
          " Eau tiède",
          " Sel",
          " 300g de viande hachée",
          " 1 oignon",
          " 2 gousses d'ail",
          " 1 cuillère à café de concentré de tomates",
          " 1 cuillère à café de moutarde",
          " 1 cuillère à café de piment en poudre",
          " Poivre"
        ],
        "instructions": [
          "Dans un grand bol, mélanger la farine avec la levure et le sel.",
          " Ajouter l'huile végétale et petit à petit de l'eau tiède tout en mélangeant, jusqu'à obtenir une pâte souple et élastique",
          " Pétrir la pâte pendant environ 10 minutes, puis laisser reposer couverte pendant au moins 30 minutes",
          " Faire chauffer un peu d'huile dans une poêle et faire revenir l'oignon haché et l'ail écrasé jusqu'à ce qu'ils deviennent translucides",
          " Ajouter la viande hachée et faire cuire jusqu'à ce qu'elle soit bien dorée",
          " Incorporer le concentré de tomate, la moutarde, le piment, le sel et le poivre. Laisser mijoter quelques minutes, puis retirer du feu et laisser refroidir",
          " Diviser la pâte en petites boules de la taille d'une balle de golf",
          " Étaler chaque boule de pâte en un cercle fin",
          " Déposer une cuillère à soupe de farce à la viande au centre de chaque cercle de pâte",
          " Replier la pâte en demi-cercle sur la farce et sceller les bords en pressant avec les doigts ou en utilisant une fourchette",
          " Chauffer l'huile dans une casserole ou une friteuse à feu moyen. Une fois l'huile chaude, y plonger les fatayas et les faire frire jusqu'à ce qu'ils soient dorés des deux côtés",
          " Retirer les fatayas de l'huile et les déposer sur du papier absorbant pour éliminer l'excès d'huile."
        ]
      },
      {
        "nom": "Accaras",
        "ingredients": [
          "2 tasses d'haricots niébé (trempés toute une nuit)",
          " 1 oignon",
          " 2 gousses d'ail",
          " Piment",
          " 1 cuillère à café de levure chimique",
          " 1 bouquet de persil frais",
          " Poivre",
          " Sel",
          " Huile végétale."
        ],
        "instructions": [
          "Rincer les haricots niébé trempés et les égoutter",
          " Dans un mixeur, moudre les haricots avec l'oignon, l'ail, le piment et le persil jusqu'à obtenir une pâte épaisse et homogène",
          " Transférer la pâte dans un bol et ajouter la levure chimique, du sel et du poivre selon ton goût. Bien mélanger",
          " Fais chauffer de l'huile dans une casserole ou une friteuse à feu moyen",
          " À l'aide d'une cuillère à soupe, prépare des petites portions de pâte et plonge-les dans l'huile chaude pour les frire",
          " Fais frire les accras jusqu'à ce qu'ils soient dorés et bien cuits à l'intérieur",
          " Retire-les de l'huile et place-les sur du papier absorbant pour éliminer l'excès d'huile."
        ]
      }
    ]
  }