{
    "fataya": [
        {
            "nom": "Fatayas",
            "ingredients": [
              "500g de farine",
              "1 cuillère à café de levure boulangère",
              "Huile végétale",
              "Eau tiède",
              "Sel",
              "300g de viande hachée",
              "1 oignon",
              "2 gousses d'ail",
              "1 cuillère à café de concentré de tomates",
              "1 cuillère à café de moutarde",
              "1 cuillère à café de piment en poudre",
              "Poivre"
            ],
            "instructions": [
              "Dans un grand bol, mélanger la farine avec la levure et le sel.",
              "Ajouter l'huile végétale et petit à petit de l'eau tiède tout en mélangeant, jusqu'à obtenir une pâte souple et élastique.",
              "Pétrir la pâte pendant environ 10 minutes, puis laisser reposer couverte pendant au moins 30 minutes.",
              "Faire chauffer un peu d'huile dans une poêle et faire revenir l'oignon haché et l'ail écrasé jusqu'à ce qu'ils deviennent translucides.",
              "Ajouter la viande hachée et faire cuire jusqu'à ce qu'elle soit bien dorée.",
              "Incorporer le concentré de tomate, la moutarde, le piment, le sel et le poivre. Laisser mijoter quelques minutes, puis retirer du feu et laisser refroidir.",
              "Diviser la pâte en petites boules de la taille d'une balle de golf.",
              "Étaler chaque boule de pâte en un cercle fin.",
              "Déposer une cuillère à soupe de farce à la viande au centre de chaque cercle de pâte.",
              "Replier la pâte en demi-cercle sur la farce et sceller les bords en pressant avec les doigts ou en utilisant une fourchette.",
              "Chauffer l'huile dans une casserole ou une friteuse à feu moyen. Une fois l'huile chaude, y plonger les fatayas et les faire frire jusqu'à ce qu'ils soient dorés des deux côtés.",
              "Retirer les fatayas de l'huile et les déposer sur du papier absorbant pour éliminer l'excès d'huile."
            ]
        }
    ]
}