{
    "kandia": [
        {
            "nom": "Soupe kandia",
            "ingredients": [
              "500g de gombos frais ou surgelés",
              "500g de fruits de mer",
              "2 oignons",
              "3 tomates",
              "3 gousses d'ail",
              "1 piment (selon le goût)",
              "2 cuillères à soupe d'huile végétale",
              "2 bouillons cube",
              "Poivre",
              "Feuilles de persil ou coriandre (optionnelles)",
              "Sel",
              "2 tasses de riz",
              "Eau"
            ],
            "instructions": [
              "Si tu utilises des poissons séchés, commence par les faire tremper dans de l'eau tiède pendant un certain temps pour les réhydrater.",
              "Dans une casserole, fais revenir les oignons hachés, l'ail écrasé et le piment dans de l'huile jusqu'à ce qu'ils deviennent translucides.",
              "Ajoute les tomates coupées en dés et laisse mijoter jusqu'à ce qu'elles soient bien cuites et que la sauce se forme.",
              "Ajoute les fruits de mer réhydratés (poissons séchés, crevettes, calamars, etc.) dans la casserole avec un peu d'eau si nécessaire.",
              "Ajoute les cubes de bouillon émiettés et assaisonne avec du sel et du poivre selon ton goût.",
              "Laisse mijoter à feu moyen jusqu'à ce que les fruits de mer soient bien cuits et que les saveurs se mélangent.",
              "Rincer abondamment le riz à l'eau froide jusqu'à ce que l'eau soit claire pour éliminer l'excès d'amidon.",
              "Dans une casserole, verser le riz et ajouter de l'eau en utilisant un ratio de 1:2 (pour chaque tasse de riz, utiliser deux tasses d'eau). Ajouter une pincée de sel.",
              "Porter à ébullition à feu moyen-élevé.",
              "Réduire le feu à son minimum, couvrir la casserole avec un couvercle hermétique et laisser mijoter pendant environ 15-20 minutes, ou jusqu'à ce que tout le liquide soit absorbé.",
              "Une fois cuit, retirer du feu et laisser reposer le riz pendant quelques minutes à couvert.",
              "Garnis éventuellement de feuilles de persil ou de coriandre avant de servir."
            ]
        }
    ]
}